---
kind: property
id: P:Autodesk.Revit.DB.SweptProfile.StartSetBack
source: html/c71b644d-3e05-56bf-fdf6-b317dd6c9c3f.htm
---
# Autodesk.Revit.DB.SweptProfile.StartSetBack Property

The distance from the start of the driving curve to the point where the sweep actually begins.

## Syntax (C#)
```csharp
public double StartSetBack { get; }
```